# Написать слово "КОПЕЙКА" в правильном формате (диапазон от 1 до 99)



a = int(input("Введите число от 1 до 99: "))
cop = a
if 11 <= cop <= 14:
    print(a, "копеек")
else:
    cop = cop % 10
    if cop == 1:
        print(a, "копейка")
    elif 2 <= cop <= 4:
        print(a, "копейки")
    else:
        print(a, "копеек")

