
#Пользователь вводит с клавиатуры пятизначное число.
#Требуется найти произведение цифр введенного числа и его среднее арифметическое.

num1 = int(input("Введите первое число: "))
num2 = int(input("Введите второе число: "))
num3 = int(input("Введите третье число: "))
num4 = int(input("Введите четвертое число: "))
num5 = int(input("Введите пятое число: "))

print("Введите пятизначное число:", 97531)
print("Произведение цифр числа 97531:", num1 * num2 * num3 * num4 * num5)
print("Среднее арифметическое:", (num1 + num2 + num3 + num4 + num5) / 5)
